contactTank/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    
    inlet
    {
        type            variableHeightFlowRateInletVelocity;
        flowRate        3;
        alpha           alpha.water;
        value           uniform (0 0 0);
    }
   
    walls
    {
        type   noSlip;
    }
    
    outlet
    {
        type            zeroGradient;    
    }

    top
    {
        type   pressureInletOutletVelocity;
        value  uniform (0 0 0);
    }

    
}


// ************************************************************************* //
