contactTank/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime; //latestTime; //startTime;

startTime       0;

stopAt          endTime; //writeNow; //endTime;

endTime         1200;

deltaT          0.005;

writeControl    adjustableRunTime;

writeInterval   10;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;

maxAlphaCo      1;

maxDeltaT       1;




functions
{

    sTransport //from tutorial case waterChannel
    {
        type            scalarTransport;
        libs            (solverFunctionObjects);

        enabled         true;
        writeControl    writeTime;
        writeInterval   1;

        field           s;
        bounded01       false;
        phase           alpha.water;

        D               1e-2; //diffusivity

        write           true;

        /*fvOptions
        {
            unitySource
            {
                type            scalarSemiImplicitSource;
                enabled         true;

                selectionMode   all;
                volumeMode      specific;

                sources
                {
                    s           (1 0);
                }
            }
        }*/

        resetOnStartUp  false;
    }
    
    /*
    scalar1 //From Wolf Dynamics- https://youtu.be/qYQki-dUqis
    {
            type                scalarTransport;
            functionObjectLibs  ("libsolverFunctionObjects.so");
            enabled             true;
            writeControl        outputTime;
            log                 yes;
            nCorr               1;

            D                   0;
            //alphaD 0;
            //alphaDt 0;

            field               s;

            //schemesField U;

    }
   
   inlet1Flux
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        writeControl    timeStep;
        log             true;
        writeFields     false;
        regionType      patch;
        name            inlet;
        operation       sum;
        fields          ( rhoPhi );
    }
    inlet2Flux
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        writeControl    timeStep;
        log             true;
        writeFields     false;
        regionType      patch;
        name            inlet;
        operation       sum;
        fields          ( rhoPhi );
    }
    outletFlux
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        writeControl    timeStep;
        log             true;
        writeFields     false;
        regionType      patch;
        name            outlet;
        operation       sum;
        fields          ( rhoPhi );
    }

    atmosphereFlux
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        writeControl    timeStep;
        log             true;
        writeFields     false;
        regionType      patch;
        name            atmosphere;
        operation       sum;
        fields          ( rhoPhi );
    }
    */
} 


// ************************************************************************* //
